package com.javarush.levchuk.constant;

import java.io.BufferedReader;
import java.nio.file.Files;
import java.nio.file.Path;
import java.util.HashMap;
import java.util.Map;

public class Alphabet {
    private static final char[] ALPHABET = {
            'а', 'б', 'в', 'г', 'д', 'е',
            'ё', 'ж', 'з', 'и', 'к', 'л',
            'м', 'н', 'о', 'п', 'р', 'с',
            'т', 'у', 'ф', 'х', 'ц', 'ч',
            'ш', 'щ', 'ъ', 'ы', 'ь', 'э',
            'я', '.', ',', '«', '»', '"',
            '\'', ':', '!', '?', ' ', '0',
            '1', '2', '3', '4', '5', '6',
            '7', '8', '9'};
    public final static Map<Character, Integer> alphabetMap = new HashMap<>();
    ;

    static {
        for (int i = 0; i < ALPHABET.length; i++) {
            alphabetMap.put(ALPHABET[i], i);
        }
    }

    public static int getAlphabetSize() {
        return ALPHABET.length;
    }

    public static char getChar(int index) {
        return ALPHABET[index];
    }

    public static int getIndexByChar(char character) {

        return alphabetMap.get(character);
    }

    public static final String[] SYLLABLES_RUS = new String[]{"ру", "ры", "рь", "рэ", "са", "ря", "сб", "рё", "св",
            "сг", "сд", "се", "сз", "си", "ск", "см", "сн", "со", "сп", "ср", "ст", "су",
            "сх", "сч", "сы", "сь", "сэ", "та", "ся", "сё", "те", "ти", "тк", "тл", "то",
            "тр", "ту", "тщ", "ты", "ть", "тэ", "тя", "уб", "ув", "тё", "уг", "уд", "уж",
            "уз", "ук", "ул", "ум", "ун", "уп", "ур", "ус", "ут", "уф", "ух", "уц", "уч",
            "уш", "фа", "фг", "фе", "фи", "фл", "фо", "фп", "фр", "фу", "фы", "фь", "фэ",
            "ха", "фя", "фё", "хв", "хе", "хж", "хз", "хи", "хл", "хо", "хр", "ху", "хы",
            "хь", "хэ", "хя", "ца", "хё", "це", "ци", "цм", "цо", "цу", "цэ", "ча", "че",
            "чи", "чо", "чр", "чт", "чу", "чь", "чэ", "ша", "чё", "шв", "ше", "ши", "шк",
            "шл", "шн", "шо", "шп", "шт", "шу", "шь", "шэ", "ща", "шё", "ще", "щи", "що",
            "щу", "щь", "щэ", "щё", "ыб", "ыв", "ыг", "ыд", "ыж", "ыз", "ык", "ыл", "ым",
            "ын", "ып", "ыр", "ыс", "ыт", "ыф", "ых", "ыц", "ыч", "ыш", "эб", "эв", "эг",
            "эд", "эк", "эл", "эм", "эн", "эп", "эр", "эс", "эт", "эф", "эх", "эц", "яб",
            "яв", "яг", "яд", "яж", "яз", "як", "ял", "ям", "ян", "яп", "яр", "яс", "ят",
            "яф", "ях", "яц", "яч", "яш", "аа", "аб", "ёв", "ав", "ёг", "аг", "ёд", "ад",
            "ёж", "аж", "ёз", "аз", "ёк", "ак", "ёл", "ал", "ём", "ам", "ён", "ан", "ао",
            "ап", "ёр", "ар", "ёс", "ас", "ёт", "ат", "ёф", "аф", "ёх", "ах", "ёц", "ац",
            "ёч", "ёш", "ач", "аш", "ащ", "ба", "бе", "би", "бл", "бо", "бр", "бу", "бы",
            "бь", "бэ", "бя", "ва", "вб", "бё", "вд", "ве", "вз", "ви", "вк", "вл", "вм",
            "вн", "во", "вп", "вр", "вс", "вт", "ву", "вх", "вч", "вш", "вы", "вь", "вэ",
            "вя", "га", "вё", "ге", "ги", "гл", "гн", "го", "гр", "гу", "гы", "гь", "гэ",
            "да", "гя", "гё", "дв", "дг", "де", "ди", "дн", "до", "др", "ду", "ды", "дь",
            "дэ", "дя", "еб", "ев", "дё", "ег", "ед", "ее", "еж", "ез", "еи", "ек", "ел",
            "ем", "ен", "еп", "ер", "ес", "ет", "еф", "ех", "ец", "еч", "еш", "ещ", "жа",
            "жд", "же", "жи", "жо", "жу", "жэ", "за", "жё", "зд", "зе", "зи", "зл", "зн",
            "зо", "зр", "зу", "зч", "зы", "зь", "зэ", "зя", "иб", "ив", "зё", "иг", "ид",
            "ие", "иж", "из", "ии", "ик", "ил", "им", "ин", "ип", "ир", "ис", "ит", "иф",
            "их", "иц", "ич", "иш", "ищ", "ка", "кв", "ке", "ки", "кк", "кл", "кн", "ко",
            "кр", "кт", "ку", "кы", "кь", "кэ", "кя", "ла", "кё", "ле", "ли", "ло", "лу",
            "лы", "ль", "лэ", "ма", "ля", "лё", "мг", "ме", "мз", "ми", "мл", "мн", "мо",
            "му", "мы", "мь", "мэ", "на", "мя", "мё", "не", "ни", "но", "нп", "нр", "ну",
            "ны", "нь", "нэ", "ня", "оа", "об", "ов", "нё", "ог", "од", "ож", "оз", "ок",
            "ол", "ом", "он", "оо", "оп", "ор", "ос", "от", "оф", "ох", "оц", "оч", "ош",
            "ощ", "па", "пе", "пи", "пл", "по", "пу", "пш", "пы", "пь", "пэ", "ра", "пя",
            "пё", "рд", "ре", "ри", "ро" };
}

